Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70J19.xml
        <register caption="Interrupt Enable Register (channel = 1)" name="TC_IER1" offset="0x64" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Disable Register (channel = 1)" name="TC_IDR1" offset="0x68" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Mask Register (channel = 1)" name="TC_IMR1" offset="0x6C" rw="R" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Extended Mode Register (channel = 1)" name="TC_EMR1" offset="0x70" rw="RW" size="4">
          <bitfield caption="Trigger Source for Input A" mask="0x00000003" name="TRIGSRCA" values="TC_EMR1__TRIGSRCA"/>
          <bitfield caption="Trigger Source for Input B" mask="0x00000030" name="TRIGSRCB" values="TC_EMR1__TRIGSRCB"/>
          <bitfield caption="No Divided Clock" mask="0x00000100" name="NODIVCLK"/>
        </register>
        <register caption="Channel Control Register (channel = 2)" name="TC_CCR2" offset="0x80" rw="W" size="4">
          <bitfield caption="Counter Clock Enable Command" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="Counter Clock Disable Command" mask="0x00000002" name="CLKDIS"/>
          <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
        </register>
        <register caption="Channel Mode Register (channel = 2)" name="TC_CMR2" offset="0x84" rw="RW" size="4">
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR2__TCCLKS"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR2__BURST"/>
          <bitfield caption="Counter Clock Stopped with RB Loading" mask="0x00000040" name="LDBSTOP"/>
          <bitfield caption="Counter Clock Disable with RB Loading" mask="0x00000080" name="LDBDIS"/>
          <bitfield caption="External Trigger Edge Selection" mask="0x00000300" name="ETRGEDG" values="TC_CMR2__ETRGEDG"/>
          <bitfield caption="TIOA or TIOB External Trigger Selection" mask="0x00000400" name="ABETRG"/>
          <bitfield caption="RC Compare Trigger Enable" mask="0x00004000" name="CPCTRG"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
          <bitfield caption="RA Loading Edge Selection" mask="0x00030000" name="LDRA" values="TC_CMR2__LDRA"/>
          <bitfield caption="RB Loading Edge Selection" mask="0x000C0000" name="LDRB" values="TC_CMR2__LDRB"/>
          <bitfield caption="Loading Edge Subsampling Ratio" mask="0x00700000" name="SBSMPLR" values="TC_CMR2__SBSMPLR"/>
        </register>
        <register caption="Stepper Motor Mode Register (channel = 2)" name="TC_SMMR2" offset="0x88" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN"/>
          <bitfield caption="Down Count" mask="0x00000002" name="DOWN"/>
        </register>
        <register caption="Register AB (channel = 2)" name="TC_RAB2" offset="0x8C" rw="R" size="4">
          <bitfield caption="Register A or Register B" mask="0xFFFFFFFF" name="RAB"/>
        </register>
        <register caption="Counter Value (channel = 2)" name="TC_CV2" offset="0x90" rw="R" size="4">
          <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
        </register>
        <register caption="Register A (channel = 2)" name="TC_RA2" offset="0x94" rw="RW" size="4">
          <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
        </register>
        <register caption="Register B (channel = 2)" name="TC_RB2" offset="0x98" rw="RW" size="4">
          <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
        </register>
        <register caption="Register C (channel = 2)" name="TC_RC2" offset="0x9C" rw="RW" size="4">
          <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
        </register>
        <register caption="Status Register (channel = 2)" name="TC_SR2" offset="0xA0" rw="R" size="4">
          <bitfield caption="Counter Overflow Status (cleared on read)" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun Status (cleared on read)" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare Status (cleared on read)" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare Status (cleared on read)" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare Status (cleared on read)" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading Status (cleared on read)" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading Status (cleared on read)" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger Status (cleared on read)" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOA Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOB Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
        <register caption="Interrupt Enable Register (channel = 2)" name="TC_IER2" offset="0xA4" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Disable Register (channel = 2)" name="TC_IDR2" offset="0xA8" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Mask Register (channel = 2)" name="TC_IMR2" offset="0xAC" rw="R" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Extended Mode Register (channel = 2)" name="TC_EMR2" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Trigger Source for Input A" mask="0x00000003" name="TRIGSRCA" values="TC_EMR2__TRIGSRCA"/>
          <bitfield caption="Trigger Source for Input B" mask="0x00000030" name="TRIGSRCB" values="TC_EMR2__TRIGSRCB"/>
          <bitfield caption="No Divided Clock" mask="0x00000100" name="NODIVCLK"/>
        </register>
        <register caption="Block Control Register" name="TC_BCR" offset="0xC0" rw="W" size="4">
          <bitfield caption="Synchro Command" mask="0x00000001" name="SYNC"/>
        </register>
        <register caption="Block Mode Register" name="TC_BMR" offset="0xC4" rw="RW" size="4">
          <bitfield caption="External Clock Signal 0 Selection" mask="0x00000003" name="TC0XC0S" values="TC_BMR__TC0XC0S"/>
          <bitfield caption="External Clock Signal 1 Selection" mask="0x0000000C" name="TC1XC1S" values="TC_BMR__TC1XC1S"/>
          <bitfield caption="External Clock Signal 2 Selection" mask="0x00000030" name="TC2XC2S" values="TC_BMR__TC2XC2S"/>
          <bitfield caption="Quadrature Decoder Enabled" mask="0x00000100" name="QDEN"/>
          <bitfield caption="Position Enabled" mask="0x00000200" name="POSEN"/>
          <bitfield caption="Speed Enabled" mask="0x00000400" name="SPEEDEN"/>
          <bitfield caption="Quadrature Decoding Transparent" mask="0x00000800" name="QDTRANS"/>
          <bitfield caption="Edge on PHA Count Mode" mask="0x00001000" name="EDGPHA"/>
          <bitfield caption="Inverted PHA" mask="0x00002000" name="INVA"/>
          <bitfield caption="Inverted PHB" mask="0x00004000" name="INVB"/>
          <bitfield caption="Inverted Index" mask="0x00008000" name="INVIDX"/>
          <bitfield caption="Swap PHA and PHB" mask="0x00010000" name="SWAP"/>
          <bitfield caption="Index Pin is PHB Pin" mask="0x00020000" name="IDXPHB"/>
          <bitfield caption="Maximum Filter" mask="0x03F00000" name="MAXFILT"/>
        </register>
